In [1]:
import pandas as pd
d=pd.DataFrame({"Name":["Abhi","Shruu","Priiii","Aishii","Ullekha","Kaavi"],
                "Education":["SSLC","LKG","PUC","Diploma","LKG","SSLC"]})
d

      Name Education
0     Abhi      SSLC
1    Shruu       LKG
2   Priiii       PUC
3   Aishii   Diploma
4  Ullekha       LKG
5    Kaavi      SSLC

In [4]:
d['Rank'] = d['Education'].rank()
d

      Name Education  Rank
0     Abhi      SSLC   5.5
1    Shruu       LKG   2.5
2   Priiii       PUC   4.0
3   Aishii   Diploma   1.0
4  Ullekha       LKG   2.5
5    Kaavi      SSLC   5.5

In [6]:
d['Rank_min'] = d['Education'].rank(method='min')
print(d)

      Name Education  Rank  Rank_min
0     Abhi      SSLC   5.5       5.0
1    Shruu       LKG   2.5       2.0
2   Priiii       PUC   4.0       4.0
3   Aishii   Diploma   1.0       1.0
4  Ullekha       LKG   2.5       2.0
5    Kaavi      SSLC   5.5       5.0